import { 도원경 } from './map/도원경';
import { 불타는세르니움 } from './map/불타는세르니움';
import { 세르니움 } from './map/세르니움';
import { 아르테리아 } from './map/아르테리아';
import { 오디움 } from './map/오디움';
import { 카르시온 } from './map/카르시온';
import { 호텔아르크스 } from './map/호텔아르크스';

export const mapData: MapData = {
  소멸의여로: [],
  리버스시티: [],
  츄츄아일랜드: [],
  얌얌아일랜드: [],
  레헬른: [],
  아르카나: [],
  모라스: [],
  에스페라: [],
  셀라스: [],
  문브릿지: [],
  고통의미궁: [],
  리멘: [],
  세르니움: 세르니움,
  불타는세르니움: 불타는세르니움,
  호텔아르크스: 호텔아르크스,
  오디움: 오디움,
  도원경: 도원경,
  아르테리아: 아르테리아,
  카르시온: 카르시온,
};
