export const araneRiverDailyQuestRegions: AraneRiverDailyQuestRegion[] = [
  '소멸의여로',
  '츄츄아일랜드',
  '레헬른',
  '아르카나',
  '모라스',
  '에스페라',
  '문브릿지',
  '고통의미궁',
  '리멘',
];

export const grandisDailyQuestRegions: GrandisDailyQuestRegion[] = [
  '세르니움',
  '호텔아르크스',
  '오디움',
  '도원경',
  '아르테리아',
  '카르시온',
];

export const araneRiverWeeklyQuestRegions: AraneRiverWeeklyQuestRegion[] = [
  '소멸의여로',
  '츄츄아일랜드',
  '레헬른',
  '아르카나',
  '모라스',
  '에스페라',
];

export const dailyQuestExp = {
  소멸의여로: 732132258,
  츄츄아일랜드: 2141658246,
  레헬른: 3189098250,
  아르카나: 3305187639,
  모라스: 4398266165,
  에스페라: 4530843954,
  문브릿지: 8397548775,
  고통의미궁: 9057690000,
  리멘: 10225741680,
  세르니움: 16455682080,
  호텔아르크스: 19371792600,
  오디움: 23246151120,
  도원경: 32127015480,
  아르테리아: 38593455264,
  카르시온: 45635222880,
};

export const dailyQuestRegions: QuestRegion[] = [
  '소멸의여로',
  '츄츄아일랜드',
  '레헬른',
  '아르카나',
  '모라스',
  '에스페라',
  '문브릿지',
  '고통의미궁',
  '리멘',
  '세르니움',
  '호텔아르크스',
  '오디움',
  '도원경',
  '아르테리아',
  '카르시온',
];

export const weeklyQuestExp = {
  소멸의여로: 187726220,
  츄츄아일랜드: 549143140,
  레헬른: 817717500,
  아르카나: 847484010,
  모라스: 1127760555,
  에스페라: 1161754860,
};

export const weeklyQuestName = {
  소멸의여로: '에르다 스펙트럼',
  츄츄아일랜드: '배고픈 무토',
  레헬른: '미드나잇 체이서',
  아르카나: '스피릿 세이비어',
  모라스: '엔하임 디펜스',
  에스페라: '프로텍트 에스페라',
};
