export const araneRiverDailyQuestRegions: AraneRiverDailyQuestRegion[] = [
  '소멸의여로',
  '츄츄아일랜드',
  '레헬른',
  '아르카나',
  '모라스',
  '에스페라',
  '문브릿지',
  '고통의미궁',
  '리멘',
];

export const grandisDailyQuestRegions: GrandisDailyQuestRegion[] = [
  '세르니움',
  '호텔아르크스',
  '오디움',
  '도원경',
  '아르테리아',
  '카르시온',
];

export const araneRiverWeeklyQuestRegions: AraneRiverWeeklyQuestRegion[] = [
  '소멸의여로',
  '츄츄아일랜드',
  '레헬른',
  '아르카나',
  '모라스',
  '에스페라',
];

export const araneRiverDailyQuestExp = {
  소멸의여로: 732132258,
  츄츄아일랜드: 2141658246,
  레헬른: 3189098250,
  아르카나: 3305187639,
  모라스: 4398266165,
  에스페라: 4530843954,
  문브릿지: 8397548775,
  고통의미궁: 9057690000,
  리멘: 10225741680,
};

export const grandisDailyQuestExp = {
  세르니움: 16455682080,
  호텔아르크스: 19371792600,
  오디움: 23246151120,
  도원경: 32127015480,
  아르테리아: 38593455264,
  카르시온: 45635222880,
};

export const dailyQuestAllRegions: QuestRegion[] = [
  '소멸의여로',
  '츄츄아일랜드',
  '레헬른',
  '아르카나',
  '모라스',
  '에스페라',
  '문브릿지',
  '고통의미궁',
  '리멘',
  '세르니움',
  '호텔아르크스',
  '오디움',
  '도원경',
  '아르테리아',
  '카르시온',
];

export const weeklyQuestExp = {
  소멸의여로: 187726220,
  츄츄아일랜드: 549143140,
  레헬른: 817717500,
  아르카나: 847484010,
  모라스: 1127760555,
  에스페라: 1161754860,
};

export const weeklyQuestName = {
  소멸의여로: '에르다 스펙트럼',
  츄츄아일랜드: '배고픈 무토',
  레헬른: '미드나잇 체이서',
  아르카나: '스피릿 세이비어',
  모라스: '엔하임 디펜스',
  에스페라: '프로텍트 에스페라',
};

export const epicDungeonRegions: EpicDungeonRegion[] = [
  '하이마운틴',
  '앵글러컴퍼니',
];

export const highMountainExp = {
  260: 194600000000,
  261: 197400000000,
  262: 200200000000,
  263: 203000000000,
  264: 206200000000,
  265: 232000000000,
  266: 235200000000,
  267: 238400000000,
  268: 242000000000,
  269: 245200000000,
  270: 256500000000,
  271: 268700000000,
  272: 272100000000,
  273: 287100000000,
  274: 291300000000,
  275: 327400000000,
  276: 331500000000,
  277: 336200000000,
  278: 340300000000,
  279: 345000000000,
  280: 387500000000,
  281: 392800000000,
  282: 397500000000,
  283: 402800000000,
  284: 407600000000,
  285: 458200000000,
  286: 463500000000,
  287: 469600000000,
  288: 475600000000,
  289: 481000000000,
  290: 481000000000,
  291: 481000000000,
  292: 481000000000,
  293: 481000000000,
  294: 481000000000,
  295: 481000000000,
  296: 481000000000,
  297: 481000000000,
  298: 481000000000,
  299: 481000000000,
};

export const epicDungeonExp: EpicDungeonExp = {
  하이마운틴: highMountainExp,
  앵글러컴퍼니: 0,
};
